# === Core CLI ===
brew "git"
brew "gh"                  # GitHub CLI
brew "git-delta"           # better git diffs
brew "fish"
brew "starship"            # prompt
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"                 # modern ls
brew "zoxide"              # smarter cd (replaces z)
brew "atuin"               # shell history with search
brew "direnv"
brew "jq"
brew "yq"
brew "htop"
brew "wget"

# === Editor ===
brew "neovim"

# === Languages / runtimes ===
brew "mise"                # unified version manager (Python/Node/Ruby/...)
brew "uv"                  # fast Python project/dep manager

# === GPG / Yubikey ===
brew "gnupg"
brew "pinentry-mac"
brew "ykman"               # Yubikey Manager CLI
cask "yubico-authenticator" # replaces discontinued yubico-yubikey-manager

# === Casks ===
cask "ghostty"
cask "visual-studio-code"
cask "1password"
cask "1password-cli"
cask "orbstack"            # Docker/container runtime, lighter than Docker Desktop
cask "rectangle"           # window management
cask "raycast"             # spotlight replacement
cask "google-chrome"
cask "slack"
cask "microsoft-teams"
cask "claude"              # Claude Desktop
cask "tableplus"           # database GUI
cask "tailscale-app"       # mesh VPN (renamed from "tailscale")

# === Fonts ===
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
